emacs.org
#+title: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ~/.emacs.d/init.el :results none mkdirp: yes
* Early Init
** Increase Garbage Collection Threshold
*NOTE:* The default is 800 kilobytes. The threshold is measured in bytes.
#+begin_src emacs-lisp
(setq gc-cons-threshold (* 1 1000 1000 1000))
;; (setq garbage-collection-messages t)
#+end_src

** Startup Performance
#+begin_src emacs-lisp
(defvar file-name-handler-alist-original file-name-handler-alist)
(setq file-name-handler-alist nil)
#+end_src

* Init
** Package Management
*** Specify Load Path
#+begin_src emacs-lisp
(add-to-list 'load-path "~/.emacs.d/lisp")
#+end_src

*** Enable AOT Compilation of External Packages
#+begin_src emacs-lisp
(setq package-native-compile t)
#+end_src

*** Setup Package Sources
#+begin_src emacs-lisp
(require 'package)
(setq package-archives
      '(("melpa" . "https://melpa.org/packages/")
        ("org" . "https://orgmode.org/elpa/")
        ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))
#+end_src

*** Setup Use-Package
#+begin_src emacs-lisp
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)
#+end_src

*** Automatic Package Updates
#+begin_src emacs-lisp
(use-package auto-package-update
  :after gcmh
  :custom
  (auto-package-update-hide-results t)
  :config
  (auto-package-update-maybe)
  (auto-package-update-at-time "09:00"))
#+end_src

** Utilities
*** No Littering
#+begin_src emacs-lisp
(use-package no-littering
  :config
  (setq auto-save-file-name-transforms
      `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
  (setq make-backup-files nil)
  (setq auto-save-default nil))
#+end_src

** Performance Improvements
*** Asynchronous Processes
#+begin_src emacs-lisp
(use-package async
  :init (dired-async-mode 1))
#+end_src

** User Interface
*** Basic Configuration
#+begin_src emacs-lisp

;; Don't show startup menu
(setq inhibit-startup-message t)
     
;; Don't ask to kill processes when exiting
(setq confirm-kill-processes nil)

;; Never pop up UI dialogs
(setq use-dialog-box nil)

;; Disable Terminal Bell
(setq ring-bell-function 'ignore)

;; Revert buffers when the underlying file has changed
(global-auto-revert-mode 1)

;; Use yes/no abbreviations in minibuffer prompts
(fset 'yes-or-no-p 'y-or-n-p)

(blink-cursor-mode 0) ;; Don't blink cursor
(scroll-bar-mode 0)   ;; Remove scroll bar
(tool-bar-mode 0)     ;; Remove toolbar
(tooltip-mode 0)      ;; Remove tooltip
(menu-bar-mode 0)     ;; Remove menubar

(set-fringe-mode 10)
#+end_src

*** Line Numbers
#+begin_src emacs-lisp
(column-number-mode)
(global-display-line-numbers-mode t)
(setq display-line-numbers-type 'relative)
#+end_src

****  Disable for some Modes
#+begin_src emacs-lisp
(dolist (mode '(term-mode-hook
                org-mode-hook
                markdown-mode-hook
                shell-mode-hook
                eshell-mode-hook
                vterm-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

*** Good Scrolling
#+begin_src emacs-lisp
(use-package good-scroll
  :config
  (good-scroll-mode 1))
#+end_src

*** Font Configuration
#+begin_src emacs-lisp
;; Set the default pitch face
(set-face-attribute 'default nil
  :family "Hack Nerd Font Mono"
  :height 120)

;; Set the fixed pitch face
(set-face-attribute 'fixed-pitch nil
  :family "Hack Nerd Font Mono"
  :height 1.0)

;; Set the variable pitch face
(set-face-attribute 'variable-pitch nil
  :family "NotoSans Nerd Font"
  :height 1.0)

(use-package mixed-pitch
  :hook (text-mode . mixed-pitch-mode))

(use-package all-the-icons)
#+end_src

*** Default Theme
#+begin_src emacs-lisp
;; Good Dark Themes: doom-moonless doom-tomorrow-night
;; Good Light Themes: doom-acario-light
(use-package doom-themes)

;; Ewal Theme
(use-package ewal-doom-themes
  :config
  (progn (load-theme 'ewal-doom-vibrant t)
         (enable-theme 'ewal-doom-vibrant)))
(use-package ewal-evil-cursors
  :after ewal-doom-themes)
#+end_src

** Characters
*** Set UTF-8 Encoding
#+begin_src emacs-lisp
(setq locale-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
(set-default-coding-systems  'utf-8)
(set-terminal-coding-system  'utf-8)
(set-keyboard-coding-system  'utf-8)
(set-selection-coding-system 'utf-8)
(set-file-name-coding-system 'utf-8)
(set-clipboard-coding-system 'utf-8)
(set-language-environment "UTF-8")
#+end_src

*** Dashboard
#+begin_src emacs-lisp
(use-package dashboard
  :config
  (dashboard-setup-startup-hook)
  (setq dashboard-center-content t)
  ;; (setq dashboard-startup-banner nil)
  (setq dashboard-week-agenda t)
  (setq initial-buffer-choice 
        (lambda () (get-buffer "*dashboard*")))
  (setq dashboard-set-init-info t)
  (setq dashboard-items '((recents . 5)
                          (bookmarks . 5)
                          (projects . 5)
                          (agenda . 5))))
#+end_src

*** Fcitx
#+begin_src emacs-lisp
(use-package fcitx
  :config
  (fcitx-aggressive-setup)
  (setq fcitx-use-dbus t))
#+end_src

** Window Management
*** Frames Only Mode
Makes popup windows appear in new windows rather than frames
#+begin_src emacs-lisp
(use-package frames-only-mode
  :config
  (frames-only-mode))
#+end_src

** Theme Configuration
*** Doom Modeline
*NOTE:* The first time you load your configuration on a new machine, you'll need to run `M-x all-the-icons-install-fonts` so that mode line icons display correctly.

#+begin_src emacs-lisp
(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :custom
  (defcustom doom-modeline-hud nil)
  (doom-modeline-window-width-limit '0.25)
  
  (doom-modeline-buffer-file-name-style 'auto)
  (doom-modeline-irc-stylize 'identity)
  (doom-modeline-checker-simple-format t)
  (doom-modeline-vcs-max-length 12)
  (doom-modeline-number-limit 99)
  (doom-modeline-buffer-state-icon nil)
  (doom-modeline-indent-info nil)
  (doom-modeline-persp-icon nil)
  (doom-modeline-workspace-name nil)
  (doom-modeline-lsp nil)
  (doom-modeline-icon t)
  (doom-modeline-color-icon t)
  (doom-modeline-github nil)
  (doom-modeline-env-version nil)
  (doom-modeline-major-mode-icon nil)
  (doom-modeline-major-mode-color-icon nil)
  (doom-modeline-buffer-modification-icon nil)
  (doom-modeline-minor-modes nil)
  (doom-modeline-enable-word-count nil)
  (doom-modeline-gnus-timer nil)
  (doom-modeline-github-timer nil)
  (doom-modeline-buffer-encoding nil))
#+end_src

** Keybinding Configuration
*** Evil Mode
#+begin_src emacs-lisp
(use-package evil
  :init
  (setq evil-want-integration t
        evil-want-keybinding nil
        evil-want-C-u-scroll t
        evil-want-C-i-jump nil)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-;") 'evil-normal-state)
  (define-key evil-normal-state-map (kbd "C-;") 'keyboard-quit)
  (define-key evil-insert-state-map (kbd "C-h")
    'evil-delete-backward-char-and-join)

  (define-key evil-motion-state-map
    (kbd "<remap> <evil-next-line>") #'evil-next-visual-line)
  (define-key evil-motion-state-map
    (kbd "<remap> <evil-previous-line>") #'evil-previous-visual-line)
  (define-key evil-operator-state-map
    (kbd "<remap> <evil-next-line>") #'evil-next-line)
  (define-key evil-operator-state-map
    (kbd "<remap> <evil-previous-line>") #'evil-previous-line)
  (global-unset-key (kbd "C-x ESC"))
  (global-unset-key (kbd "C-c ESC")))
#+end_src

**** Disable in Certain Modes
#+begin_src emacs-lisp
;; (dolist (mode '(term-mode-hook
;;                 org-mode-hook
;;                 shell-mode-hook
;;                 eshell-mode-hook
;;                 vterm-mode-hook))
;;   (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

**** Evil Collection
#+begin_src emacs-lisp
(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))
#+end_src

*** General
#+begin_src emacs-lisp
(use-package general
  :after evil
  :config
  (general-create-definer my/leader-keys
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC")

  (my/leader-keys
    "tt" 'counsel-load-theme))
#+end_src

** Autocomplete Modes
*** Ivy
#+begin_src emacs-lisp
(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
  :config (ivy-mode 1))
#+end_src

