emacs.org
**** Ivy-PosFrame
#+begin_src emacs-lisp
(use-package ivy-posframe
  :after ivy
  :config
  (setq ivy-posframe-width (frame-width)
        ivy-posframe-height (/ (frame-height) 5))
  (setq ivy-posframe-display-functions-alist
        '((t . ivy-posframe-display-at-frame-bottom-left)))
  (set-face-attribute
   'ivy-posframe nil
   :foreground "white"
   :background "black")
  (ivy-posframe-mode 1))
#+end_src

**** Ivy Clipmenu
#+begin_src emacs-lisp
(use-package ivy-clipmenu)
#+end_src

**** Ivy-Rich
#+begin_src emacs-lisp
(use-package ivy-rich
  :after ivy
  :init (ivy-rich-mode 1))
#+end_src

**** Ivy-Prescient
#+begin_src emacs-lisp
(use-package ivy-prescient
  :after counsel
  :custom
  (ivy-prescient-enable-filtering nil)
  :config
  (prescient-persist-mode 1)
  (ivy-prescient-mode 1))
#+end_src

*** Counsel
#+begin_src emacs-lisp
(use-package counsel
  :bind (("C-M-j" . 'counsel-switch-buffer)
         :map minibuffer-local-map
         ("C-r" . 'counsel-minibuffer-history))
  :custom
  (counsel-linux-app-format-function
   #'counsel-linux-app-format-function-name-only)
  :config
  (counsel-mode 1))
#+end_src

** Other Modes
*** Helpful
#+begin_src emacs-lisp
(use-package helpful
  :commands (helpful-callable
             helpful-variable
             helpful-command helpful-key)
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))
#+end_src

*** Focus Mode
#+begin_src emacs-lisp
(use-package focus)
#+end_src

*** Solaire Mode
#+begin_src emacs-lisp
(use-package solaire-mode
  :config (solaire-global-mode 1))
#+end_src

** Org Mode
*** Org-Roam
#+begin_src emacs-lisp
(use-package org-roam
  :custom
  (org-roam-directory "~/RoamNotes")
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n i" . org-roam-node-insert))
  :config
  (org-roam-setup))
#+end_src

*** Basic Config
#+begin_src emacs-lisp
(setq-default
 help-window-select t
 debug-on-error t
 indent-tabs-mode nil
 jit-lock-defer-time 0
 window-combination-resize t
 history-delete-duplicates t)

(use-package adaptive-wrap
  :config
  (visual-line-mode 1)
  (adaptive-wrap-prefix-mode 1))

(defun org/setup ()
  (org-indent-mode 1))

(use-package org
  :pin org
  :commands (org-capture org-agenda)
  :hook (org-mode . org/setup)
  :config
  
  ;; Replace list hyphen with dot
  (font-lock-add-keywords
   'org-mode
   '(("^ *\\([-]\\) "
      (0 (prog1 () (compose-region
                    (match-beginning 1)
                    (match-end 1) "•"))))))
  (setq-default
   org-ellipsis " ▾"
   org-pretty-entities t
   org-hide-emphasis-markers t
   org-edit-src-content-indentation 0))
#+end_src

**** Nicer Heading Bullets
[[https://github.com/sabof/org-bullets][org-bullets]] replaces the heading stars in =org-mode= buffers with nicer looking characters that you can control.  Another option for this is [[https://github.com/integral-dw/org-superstar-mode][org-superstar-mode]] which we may cover in a later video.

#+begin_src emacs-lisp
(use-package org-bullets
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list
   '("◉" "○" "●" "○" "●" "○" "●")))
#+end_src

**** Center Org Buffers
#+begin_src emacs-lisp
(setq-default fill-column 80)
(use-package olivetti
  :hook (org-mode . olivetti-mode)
  :hook (markdown-mode . olivetti-mode))
#+end_src

*** Drag and Drop Images
#+begin_src emacs-lisp
(use-package org-download
  :after org
  :config
  (org-download-enable))
#+end_src

*** Latex Support
#+begin_src emacs-lisp
(use-package auctex
  :defer t
  :config
  (setq TeX-auto-save t
        TeX-parse-self t)
  (setq org-format-latex-options (plist-put org-format-latex-options
                                            :scale 2.0)))
#+end_src

*** Configure Babel Languages
#+begin_src emacs-lisp
(with-eval-after-load 'org
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)
     (haskell . t)
     (shell . t)))
  (push '("conf-unix" . conf-unix) org-src-lang-modes))
#+end_src

*** Structure Templates
Org Mode's [[https://orgmode.org/manual/Structure-Templates.html][structure templates]] feature enables you to quickly insert code blocks into your Org files in combination with =org-tempo= by typing =<= followed by the template name like =el= or =py= and then press =TAB=.

#+begin_src emacs-lisp
(with-eval-after-load 'org
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("hs" . "src haskell")))
#+end_src

*** Auto-tangle Configuration Files
#+begin_src emacs-lisp
(defun babel/tangle-config ()
  (when (member (file-name-nondirectory (buffer-file-name))
                '("emacs.org"
                  "config.org"))
    (let ((org-confirm-babel-evaluate nil)) (org-babel-tangle)))) 

(add-hook 'org-mode-hook
          (lambda () (add-hook 'after-save-hook #'babel/tangle-config)))
#+end_src

*** Org-Alert
#+begin_src emacs-lisp
(use-package org-alert
  :ensure t
  :config
  (setq alert-default-style 'libnotify
        org-alert-notify-cutoff (* 2 24 60 60))
  (org-alert-enable))
#+end_src

** Development
*** Projectile
#+begin_src emacs-lisp
(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  (setq projectile-project-search-path '("~/Repositories")
        projectile-switch-project-action #'projectile-dired))

(use-package counsel-projectile
  :after projectile
  :config (counsel-projectile-mode))
#+end_src

*** Magit
#+begin_src emacs-lisp
(use-package magit
  :commands magit-status
  :custom
  (magit-display-buffer-function
   #'magit-display-buffer-same-window-except-diff-v1))

;; (use-package forge
;;  :after magit)
#+end_src

*** Evil Commentary
#+begin_src emacs-lisp
(use-package evil-commentary
  :config (evil-commentary-mode))
#+end_src

*** Rainbow Delimiters
#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode)
  :config (show-paren-mode 1))
#+end_src

** Flyspell
*** Popup Buffers
#+begin_src emacs-lisp
(use-package flyspell-correct-popup)
#+end_src bash

*** Start Flyspell with Certain Modes
#+begin_src emacs-lisp
(dolist (hook '(text-mode-hook org-mode-hook))
  (add-hook hook (lambda () (flyspell-mode 1))))
(dolist (hook '(change-log-mode-hook log-edit-mode-hook))
  (add-hook hook (lambda () (flyspell-mode -1))))
(dolist (hook '(python-mode-hook))
  (add-hook hook (lambda () (flyspell-prog-mode 1))))
#+end_src bash

*** Check Spelling On Demand
#+begin_src emacs-lisp
(defun flyspell/english ()
  (interactive)
  (ispell-change-dictionary "english")
  (flyspell-buffer))
  
(defun flyspell/russian ()
  (interactive)
  (ispell-change-dictionary "russian")
  (flyspell-buffer))
#+end_src bash

** Which Key
#+begin_src emacs-lisp
(use-package which-key)
#+end_src

** LSP-Mode
*** Flycheck
#+begin_src emacs-lisp
(use-package flycheck
  :ensure t
  :defer t
  :init (global-flycheck-mode t))
  #+end_src

*** Basic Setup
#+begin_src emacs-lisp
(defun lsp/mode-setup ()
  (setq lsp-headerline-breadcrumb-segments
        '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :hook (lsp-mode . lsp/mode-setup)
  :init
  (setq lsp-keymap-prefix "C-l")
  :config
  (lsp-enable-which-key-integration t))
#+end_src

*** LSP UI
Gives sidelines, documentation popups, and references popups
#+begin_src emacs-lisp
(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-doc-position 'bottom))
#+end_src

*** LSP Ivy
Allows you to quckly find definitions.
#+begin_src emacs-lisp
(use-package lsp-ivy
  :after lsp)
#+end_src

*** Company Mode
#+begin_src emacs-lisp
(use-package company
  :defer t
  :after lsp
  :init (global-company-mode t)
  :config
  :hook (lsp-mode . company-mode)
  :bind (:map company-active-map
              ("<tab>" . company-complete-selection))
        (:map lsp-mode-map
              ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))
#+end_src

**** Company Box Mode
#+begin_src emacs-lisp
(use-package company-box
  :hook (company-mode . company-box-mode))
#+end_src

** File Managers
*** Dired
#+begin_src emacs-lisp
(use-package dired
  :ensure nil
  :commands (dired dired-jump)
  :bind (("C-x C-j" . dired-jump))
  :custom ((dired-listing-switches "-alh --group-directories-first"))
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "h" 'dired-single-up-directory
    "l" 'dired-single-buffer))
#+end_src

**** Prevent Dired from Creating Extra Buffers
#+begin_src emacs-lisp
(use-package dired-single
  :after dired)
#+end_src

****  Dired Icons
#+begin_src emacs-lisp
(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode))
#+end_src

****  Open Files in External Programs
#+begin_src emacs-lisp
(use-package dired-open
  :after dired
  :config
  (setq dired-open-extensions
        '(("png" . "feh")
          ("mkv" . "mpv"))))

#+end_src

