emacs.org
****  Hide/Show Dotfiles
#+begin_src emacs-lisp
(use-package dired-hide-dotfiles
  :hook (dired-mode . dired-hide-dotfiles-mode)
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "H" 'dired-hide-dotfiles-mode))
#+end_src

** Languages
*** Vimscript
#+begin_src emacs-lisp
(use-package vimrc-mode
  :mode "\\.vim\\'")
#+end_src

*** Haskell
#+begin_src emacs-lisp
(use-package haskell-mode
  :mode "\\.hs\\'")
#+end_src

*** JSON
#+begin_src emacs-lisp
(use-package json-mode)
#+end_src

*** TypeScript
#+begin_src emacs-lisp
(use-package typescript-mode
  :mode "\\.ts\\'"
  :hook (typescript-mode . lsp-deferred)
  :config
  (setq typescript-indent-level 2))
#+end_src

*** Rust
#+begin_src emacs-lisp
(use-package rust-mode
  :mode "\\.rs\\'"
  :hook (rust-mode-hook . lsp-deferred))
#+end_src

*** Makefile
#+begin_src emacs-lisp
(use-package make-mode
  :mode (("Makefile" . makefile-gmake-mode)))
#+end_src

*** Python
#+begin_src emacs-lisp
(use-package transient)
(use-package pyvenv)
(use-package poetry)
#+end_src

*** Verilog
#+begin_src emacs-lisp :tangle no
(use-package verilog-mode
  :config
  (setq verilog-align-ifelse nil
        verilog-auto-delete-trailing-whitespace nil
        verilog-auto-inst-param-value nil
        verilog-auto-inst-vector nil
        verilog-auto-lineup 'all
        verilog-auto-newline nil
        verilog-auto-save-policy nil
        verilog-auto-template-warn-unused nil
        verilog-highlight-grouping-keywords nil
        verilog-highlight-modules nil
        verilog-tab-to-comment nil))

(eval-after-load 'verilog-mode
    '(progn
        ;; same for all the electric-verilog-* commands in                
        ;; the mode's map (see verilog-mode.el)                      
        (define-key verilog-mode-map (kbd ";") 'self-insert-command)
        (define-key verilog-mode-map (kbd ":") 'self-insert-command)
        (define-key verilog-mode-map (kbd "RET") 'evil-ret)
        (define-key verilog-mode-map (kbd "TAB") 'tab-to-tab-stop)))

(require 'lsp-verilog)
(custom-set-variables
 '(lsp-clients-svlangserver-launchConfiguration "/bin/verilator -sv --lint-only -Wall")
 '(lsp-clients-svlangserver-formatCommand "/bin/verible-verilog-format"))
(add-hook 'verilog-mode-hook #'lsp-deferred)
#+end_src

*** Company Mode
#+begin_src emacs-lisp
(use-package verilog-mode
  :defer t
  :config
  (require 'lsp)
  (lsp-register-client
   (make-lsp-client :new-connection (lsp-stdio-connection '("svls"))
   :major-modes '(verilog-mode)
   :priority -1
   ))
  :hook (verilog-mode . (lambda()
      (lsp)
      (flycheck-mode t)
      (add-to-list 'lsp-language-id-configuration '(verilog-mode . "verilog")))))
#+end_src

*** Makefiles
#+begin_src emacs-lisp
(use-package make-mode
  :mode (("Makefile" . makefile-gmake-mode)))
#+end_src

** Terminals
*** Term Mode
#+begin_src emacs-lisp
(use-package term
  :commands term
  :config
  (setq explicit-shell-file-name "zsh"))
#+end_src

**** Better term-mode colors
*NOTE:* This package requires =ncurses= to be installed on your machine.
#+begin_src emacs-lisp
(use-package eterm-256color
  :hook (term-mode . eterm-256color-mode))
#+end_src

*** Vterm
#+begin_src emacs-lisp
(use-package vterm
  :commands vterm
  :config
  (setq vterm-shell "zsh")
  (setq vterm-max-scrollback 10000))
#+end_src

** Closing Configuration
*** Enable File Name Handler
#+begin_src emacs-lisp
(setq file-name-handler-alist
      file-name-handler-alist-original)
#+end_src

*** Enable Garbage Collector Magic Hack
#+begin_src emacs-lisp
(use-package gcmh
  :config
  (setq gcmh-high-cons-threshold (* 100 1000 1000))
  (gcmh-mode 1))
#+end_src
