dotfiles/emacs.d/init.el

(use-package dired-hide-dotfiles
  :hook (dired-mode . dired-hide-dotfiles-mode)
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "H" 'dired-hide-dotfiles-mode))

(use-package vimrc-mode
  :mode "\\.vim\\'")

(use-package haskell-mode
  :mode "\\.hs\\'")

(use-package json-mode)

(use-package typescript-mode
  :mode "\\.ts\\'"
  :hook (typescript-mode . lsp-deferred)
  :config
  (setq typescript-indent-level 2))

(use-package rust-mode
  :mode "\\.rs\\'"
  :hook (rust-mode-hook . lsp-deferred))

(use-package make-mode
  :mode (("Makefile" . makefile-gmake-mode)))

(use-package transient)
(use-package pyvenv)
(use-package poetry)

(use-package verilog-mode
  :defer t
  :config
  (require 'lsp)
  (lsp-register-client
   (make-lsp-client :new-connection (lsp-stdio-connection '("svls"))
   :major-modes '(verilog-mode)
   :priority -1
   ))
  :hook (verilog-mode . (lambda()
      (lsp)
      (flycheck-mode t)
      (add-to-list 'lsp-language-id-configuration '(verilog-mode . "verilog")))))

(use-package make-mode
  :mode (("Makefile" . makefile-gmake-mode)))

(use-package term
  :commands term
  :config
  (setq explicit-shell-file-name "zsh"))

(use-package eterm-256color
  :hook (term-mode . eterm-256color-mode))

(use-package vterm
  :commands vterm
  :config
  (setq vterm-shell "zsh")
  (setq vterm-max-scrollback 10000))

(setq file-name-handler-alist
      file-name-handler-alist-original)

(use-package gcmh
  :config
  (setq gcmh-high-cons-threshold (* 100 1000 1000))
  (gcmh-mode 1))
